In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv("salary.csv")

In [3]:
df

   ID  Gender   Salary    Country  Company
0   1    Male  15000.0      India   Google
1   2  Female  45000.0      China      NaN
2   3  Female  25000.0      India   Google
3   4     NaN      NaN  Australia   Google
4   5    Male      NaN      India   Google
5   6    Male  54000.0        NaN  Alibaba
6   7     NaN  74000.0      China      NaN
7   8    Male  14000.0  Australia      NaN
8   9  Female  15000.0        NaN      NaN
9  10    Male  33000.0  Australia      NaN

In [4]:
df.isna().sum()

ID         0
Gender     2
Salary     2
Country    2
Company    5
dtype: int64

In [5]:
df.sample()

   ID Gender   Salary    Country Company
7   8   Male  14000.0  Australia     NaN

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   ID       10 non-null     int64
 1   Gender   8 non-null      object
 2   Salary   8 non-null      float64
 3   Country  8 non-null      object
 4   Company  5 non-null      object
dtypes: float64(1), int64(1), object(3)
memory usage: 532.0+ bytes

In [8]:
df.describe().round()

         ID   Salary
count  10.0      8.0
mean    6.0  34375.0
std     3.0  21791.0
min     1.0  14000.0
25%     3.0  15000.0
50%     6.0  29000.0
75%     8.0  47250.0
max    10.0  74000.0

In [9]:
df['Salary'].notna()

0     True
1     True
2     True
3    False
4    False
5     True
6     True
7     True
8     True
9     True
Name: Salary, dtype: bool

In [10]:
df.fillna(0)

   ID  Gender   Salary    Country  Company
0   1    Male  15000.0      India   Google
1   2  Female  45000.0      China        0
2   3  Female  25000.0      India   Google
3   4       0      0.0  Australia   Google
4   5    Male      0.0      India   Google
5   6    Male  54000.0          0  Alibaba
6   7       0  74000.0      China        0
7   8    Male  14000.0  Australia        0
8   9  Female  15000.0          0        0
9  10    Male  33000.0  Australia        0

In [12]:
df['Salary'].fillna(0)

0    15000.0
1    45000.0
2    25000.0
3        0.0
4        0.0
5    54000.0
6    74000.0
7    14000.0
8    15000.0
9    33000.0
Name: Salary, dtype: float64

In [13]:
df['Company'].fillna("missing",inplace=True)

In [14]:
df

   ID  Gender   Salary    Country  Company
0   1    Male  15000.0      India   Google
1   2  Female  45000.0      China  missing
2   3  Female  25000.0      India   Google
3   4     NaN      NaN  Australia   Google
4   5    Male      NaN      India   Google
5   6    Male  54000.0        NaN  Alibaba
6   7     NaN  74000.0      China  missing
7   8    Male  14000.0  Australia  missing
8   9  Female  15000.0        NaN  missing
9  10    Male  33000.0  Australia  missing

In [16]:
df["Salary"].mean()

34375.0

In [17]:
df["Salary"].fillna(34375.0,inplace=True)

In [18]:
df

   ID  Gender   Salary    Country  Company
0   1    Male  15000.0      India   Google
1   2  Female  45000.0      China  missing
2   3  Female  25000.0      India   Google
3   4     NaN  34375.0  Australia   Google
4   5    Male  34375.0      India   Google
5   6    Male  54000.0        NaN  Alibaba
6   7     NaN  74000.0      China  missing
7   8    Male  14000.0  Australia  missing
8   9  Female  15000.0        NaN  missing
9  10    Male  33000.0  Australia  missing

In [19]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
 "toy": [np.nan, 'Batmobile', 'Bullwhip'],
 "born": [pd.NaT, pd.Timestamp("1940-04-25"),
 pd.NaT]})
df

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [20]:
df.dropna()

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [21]:
df.dropna(how="all")

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [22]:
df.dropna(thresh=2)

       name        toy       born
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [24]:
df.dropna(subset = ["name","toy"])

       name        toy       born
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [25]:
data = {'Gender':['m','f','f','m','f','m','m'],'Height':[172,171,169,173,170,175,178]}
df_sample = pd.DataFrame(data)
df_sample

  Gender  Height
0      m     172
1      f     171
2      f     169
3      m     173
4      f     170
5      m     175
6      m     178

In [26]:
df_sample.groupby("Gender")

In [27]:
by_gender = df_sample.groupby("Gender")

In [28]:
by_gender.mean()

        Height
Gender
f        170.0
m        174.5

In [29]:
by_gender = df_sample.groupby('Gender')

for name,group in by_gender:
    print(group)

  Gender  Height
1      f     171
2      f     169
4      f     170
  Gender  Height
0      m     172
3      m     173
5      m     175
6      m     178

In [38]:
df = pd.read_csv("sample_data.csv")
df

           Date Region                 Type  Units  Sales
0    11-07-2020   East  Children's Clothing   18.0    306
1    23-09-2020  North  Children's Clothing   14.0    448
2    02-04-2020  South     Women's Clothing   17.0    425
3    28-02-2020   East  Children's Clothing   26.0    832
4    19-03-2020   West     Women's Clothing    3.0     33
..          ...    ...                  ...    ...    ...
995  11-02-2020   East  Children's Clothing   35.0    735
996  25-12-2020  North       Men's Clothing    NaN   1155
997  31-08-2020  South       Men's Clothing   13.0    208
998  23-08-2020  South     Women's Clothing   17.0    493
999  17-08-2020  North     Women's Clothing   25.0    300

[1000 rows x 5 columns]

In [41]:
df['avg sales'] = df['Units'] * df['Sales']

In [42]:
df

           Date Region                 Type  Units  Sales  avg sales
0    11-07-2020   East  Children's Clothing   18.0    306     5508.0
1    23-09-2020  North  Children's Clothing   14.0    448     6272.0
2    02-04-2020  South     Women's Clothing   17.0    425     7225.0
3    28-02-2020   East  Children's Clothing   26.0    832    21632.0
4    19-03-2020   West     Women's Clothing    3.0     33       99.0
..          ...    ...                  ...    ...    ...        ...
995  11-02-2020   East  Children's Clothing   35.0    735    25725.0
996  25-12-2020  North       Men's Clothing    NaN   1155        NaN
997  31-08-2020  South       Men's Clothing   13.0    208     2704.0
998  23-08-2020  South     Women's Clothing   17.0    493     8381.0
999  17-08-2020  North     Women's Clothing   25.0    300     7500.0

[1000 rows x 6 columns]

In [32]:
df.groupby(["Region","Type"]).sum()

C:\Users\Admin\AppData\Local\Temp\ipykernel_12396\910546029.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby(["Region","Type"]).sum()

                             Units  Sales
Region Type
East   Children's Clothing  2318.0  45849
       Men's Clothing       2420.0  51685
       Women's Clothing     3372.0  70229
North  Children's Clothing  1763.0  37306
       Men's Clothing          0.0  39975
       Women's Clothing     2596.0  61419
South  Children's Clothing  1017.0  18570
       Men's Clothing        725.0  18542
       Women's Clothing     1056.0  22203
West   Children's Clothing   789.0  20182
       Men's Clothing        829.0  19077
       Women's Clothing     1006.0  22217